app/controllers/forests_controller.rb

  def index
    @forests = Forest.all
---
SELECT "forests".* FROM "forests"

  def create
    @forest = Forest.new(forest_params)

    respond_to do |format|
      if @forest.save
---
INSERT INTO "forests" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Bolinne"], ["created_at", "2020-05-22 22:12:32.084128"], ["updated_at", "2020-05-22 22:12:32.084128"]]

    def set_forest
      @forest = Forest.find(params[:id])
---
SELECT "forests".* FROM "forests" WHERE "forests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]