app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants"
---
  def index
    @plants = Plant.all

INSERT INTO "plants" ("name", "common_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Staphylea colchica - Stev."], ["common_name", "Bladdernut"], ["created_at", "2020-05-23 09:51:27.510969"], ["updated_at", "2020-05-23 09:51:27.510969"]]
---
  def create
    @forest = Forest.find(params[:forest_id])
    @plant = @forest.plants.new(plant_params)

    respond_to do |format|
      if @plant.save

SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_plant
      @plant = Plant.find(params[:id])